In [2]:
import pandas as pd

###### 1) What is Pandas Merging Function ?
2) Parameters of Pandas Merging Function 
3) Pandas merge on 
4) Pandas merge how
5) Pandas merge indicator
6) Pandas merge left_index
7) Pandas merge right_index
8) Pandas merge suffixes

In [3]:
data=pd.DataFrame({'ID':[1,2,3,4],'Class':[9,10,11,12]})

In [4]:
data

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [5]:
df2=pd.DataFrame({'ID':[1,2,3,5],'Name':['A','B','C','D']})

In [6]:
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   5    D

In [7]:
pd.merge(data,df2,on='ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [8]:
pd.merge(df2,data,on='ID')

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [10]:
pd.merge(df2,data,on='ID')

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [11]:
pd.merge(df2,data,on='ID',how='inner')

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [12]:
pd.merge(data,df2,on='ID',how='left')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [13]:
pd.merge(data,df2,on='ID',how='right')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5    NaN    D